import 'package:flutter/material.dart';

class AlHadethAlqudse extends StatefulWidget {
  const AlHadethAlqudse({super.key});

  @override
  State<AlHadethAlqudse> createState() => _AlHadethAlqudseState();
}

class _AlHadethAlqudseState extends State<AlHadethAlqudse> {
  List<String> list = [
    ''' قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم قال اللهُ تبارَك وتعالى: (مَن أظلَمُ ممَّن ذهَب يخلُقُ كخَلْقي فلْيخلُقوا حَبَّةً أو لِيخلُقوا ذَرَّةً).

''',
    ''' قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: (يقولُ اللَّهُ: إذا أرادَ عَبْدِي أنْ يَعْمَلَ سَيِّئَةً، فلا تَكْتُبُوها عليه حتَّى يَعْمَلَها، فإنْ عَمِلَها فاكْتُبُوها بمِثْلِها، وإنْ تَرَكَها مِن أجْلِي فاكْتُبُوها له حَسَنَةً، وإذا أرادَ أنْ يَعْمَلَ حَسَنَةً فَلَمْ يَعْمَلْها فاكْتُبُوها له حَسَنَةً، فإنْ عَمِلَها فاكْتُبُوها له بعَشْرِ أمْثالِها إلى سَبْعِ مِئَةِ ضِعْفٍ)
''',
    ''' قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: (قالَ اللَّهُ عزَّ وجلَّ: ومَن أظْلَمُ مِمَّنْ ذَهَبَ يَخْلُقُ كَخَلْقِي، فَلْيَخْلُقُوا ذَرَّةً أوْ لِيَخْلُقُوا حَبَّةً أوْ شَعِيرَةً)

''',
    '''قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: (أَلَمْ تَرَوْا إلى ما قالَ رَبُّكُمْ؟ قالَ: ما أَنْعَمْتُ علَى عِبَادِي مِن نِعْمَةٍ إِلَّا أَصْبَحَ فَرِيقٌ منهمْ بِهَا كَافِرِينَ. يقولونَ الكَوَاكِبُ وَبِالْكَوَاكِبِ)
 ''',
    '''قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم قال اللهُ تبارَك وتعالى: (يُؤْذِينِي ابنُ آدَمَ، يَسُبُّ الدَّهْرَ وأنا الدَّهْرُ، أُقَلِّبُ اللَّيْلَ والنَّهارَ)

 ''',
    ''' قال رسول الله صلى الله عليه وسلم:(قالَ اللَّهُ تبارَكَ وتعالى يا ابنَ آدمَ إنَّكَ ما دعوتَني ورجوتَني غفَرتُ لَكَ على ما كانَ فيكَ ولا أبالي، يا ابنَ آدمَ لو بلغت ذنوبُكَ عَنانَ السَّماءِ ثمَّ استغفرتَني غفرتُ لَكَ، ولا أبالي، يا ابنَ آدمَ إنَّكَ لو أتيتَني بقرابِ الأرضِ خطايا ثمَّ لقيتَني لا تشرِكُ بي شيئًا لأتيتُكَ بقرابِها مغفرةً)

''',
    ''' قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: ( قالَ اللَّهُ: أعْدَدْتُ لِعِبادِي الصَّالِحِينَ ما لا عَيْنٌ رَأَتْ، ولا أُذُنٌ سَمِعَتْ، ولا خَطَرَ علَى قَلْبِ بَشَرٍ).''',
    '''إذا أحَبَّ اللَّهُ عَبْدًا نادَى جِبْرِيلَ: (إنَّ اللَّهَ يُحِبُّ فُلانًا فأحِبَّهُ، فيُحِبُّهُ جِبْرِيلُ، فيُنادِي جِبْرِيلُ في أهْلِ السَّماءِ: إنَّ اللَّهَ يُحِبُّ فُلانًا فأحِبُّوهُ، فيُحِبُّهُ أهْلُ السَّماءِ، ثُمَّ يُوضَعُ له القَبُولُ في أهْلِ الأرْضِ).

''',
    ''' يَنْزِلُ رَبُّنَا تَبَارَكَ وتَعَالَى كُلَّ لَيْلَةٍ إلى السَّمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرُ يقولُ: (مَن يَدْعُونِي، فأسْتَجِيبَ له مَن يَسْأَلُنِي فَأُعْطِيَهُ، مَن يَسْتَغْفِرُنِي فأغْفِرَ له)
''',
    ''' قال اللهُ تعالى : (أيُّما عبدٍ منْ عبادِي يخرجُ مجاهدًا في سبيلِي، ابتغاءَ مرضاتِي ضَمِنْتُ لهُ أنْ أُرجِعَهُ إنْ رجعتُهُ بِما أصابَ منْ أجرٍ أو غنيمةٍ، و إنْ قَبَضْتُهُ أنْ أغفرَ لهُ و أرحمَهُ و أُدخلُهُ الجنةَ)

''',
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        backgroundColor: Colors.blue.shade100,
        title: Text(
          'أحاديث قدسية  ',
        ),
        actions: [
          SizedBox(
            width: 15,
          ),
          Image.asset(
            'assets/Images/nabawe.png',
            color: Colors.white,
            height: 50,
            width: 50,
          ),
          SizedBox(
            width: 15,
          ),
        ],
      ),
      body: ListView.builder(
        itemCount: list.length,
        itemBuilder: (context, index) => AlHadehALnabaweWidgets(list[index]),
      ),
    );
  }
}

class AlHadehALnabaweWidgets extends StatelessWidget {
  AlHadehALnabaweWidgets(this.list);
  String list;
  @override
  Widget build(BuildContext context) {
    return Container(
      decoration: BoxDecoration(
          color: Colors.blue.shade100,
          borderRadius: BorderRadius.all(Radius.circular(10))),
      padding: EdgeInsets.all(10),
      margin: EdgeInsets.all(5),
      child: Text(
        textAlign: TextAlign.end,
        list,
        style: TextStyle(fontSize: 22, fontWeight: FontWeight.w300),
      ),
    );
  }
}
