import 'package:flutter/material.dart';
import 'package:flutter_application_1/QuranApp/Models/SajdaList.dart';

class SajdaAyatt extends StatefulWidget {
  int num;
  SajdaAyatt(this.num);
  @override
  State<SajdaAyatt> createState() => _SajdaAyattState(num);
}

List<String> sajdaA = [
  '''  «إِنَّ الَّذِينَ عِندَ رَبِّكَ لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ وَيُسَبِّحُونَهُ وَلَهُ يَسْجُدُونَ»، \n\n سورة الأعراف: الآية 206.''',
  '«وَلِلَّهِ يَسْجُدُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَالُهُم بِالْغُدُوِّ وَالْآصَالِ»،\n\n  سورة الرعد: الآية 15.',
  '«وَلِلَّهِ يَسْجُدُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مِن دَابَّةٍ وَالْمَلَائِكَةُ وَهُمْ لَا يَسْتَكْبِرُونَ»،\n\n  سورة النحل: الآية 49 .',
  '«قُلْ آمِنُوا بِهِ أَوْ لَا تُؤْمِنُوا إِنَّ الَّذِينَ أُوتُوا الْعِلْمَ مِن قَبْلِهِ إِذَا يُتْلَىٰ عَلَيْهِمْ يَخِرُّونَ لِلْأَذْقَانِ سُجَّدًا»،\n سورة الإسراء: الآية 107 ',
  '«إذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُ الرَّحْمَٰنِ خَرُّوا سُجَّدًا وَبُكِيًّا»،\n\n  سورة مريم: الآية 58.',
  '«أَلَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ مَن فِي السَّمَاوَاتِ وَمَن فِي الْأَرْضِ وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُومُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَابُّ وَكَثِيرٌ مِّنَ النَّاسِ وَكَثِيرٌ حَقَّ عَلَيْهِ الْعَذَابُ وَمَن يُهِنِ اللَّهُ فَمَا لَهُ مِن مُّكْرِمٍ إِنَّ اللَّهَ يَفْعَلُ مَا يَشَاءُ»،\n سورة الحج: الآية 18.',
  '«يَا أَيُّهَا الَّذِينَ آمَنُوا ارْكَعُوا وَاسْجُدُوا وَاعْبُدُوا رَبَّكُمْ وَافْعَلُوا الْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ»،\n \n سورة الحج: الآية 77 .',
  '«وَإِذَا قِيلَ لَهُمُ اسْجُدُوا لِلرَّحْمَٰنِ قَالُوا وَمَا الرَّحْمَٰنُ أَنَسْجُدُ لِمَا تَأْمُرُنَا وَزَادَهُمْ نُفُورًا»،\n\n  سورة الفرقان: الآية 60 .',
  '«أَلَّا يَسْجُدُوا لِلَّهِ الَّذِي يُخْرِجُ الْخَبْءَ فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُخْفُونَ وَمَا تُعْلِنُونَ»،\n\n  سورة النمل: الآية 25 .',
  '«إِنَّمَا يُؤْمِنُ بِآيَاتِنَا الَّذِينَ إِذَا ذُكِّرُوا بِهَا خَرُّوا سُجَّدًا وَسَبَّحُوا بِحَمْدِ رَبِّهِمْ وَهُمْ لَا يَسْتَكْبِرُونَ»،\n\n  سورة السجدة: الآية 15 .',
  '«وَظَنَّ دَاوُودُ أَنَّمَا فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَأَنَابَ»، \nسورة ص: الآية \n 24.',
  '«وَمِنْ آيَاتِهِ اللَّيْلُ وَالنَّهَارُ وَالشَّمْسُ وَالْقَمَرُ لا تَسْجُدُوا لِلشَّمْسِ وَلا لِلْقَمَرِ وَاسْجُدُوا لِلَّهِ الَّذِي خَلَقَهُنَّ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ»،\n\n  سورة فصلت: الآية 37.',
  '«فَاسْجُدُوا لِلَّهِ وَاعْبُدُوا»، \n \n nسورة النجم: الآية 62.',
  '«وَإِذَا قُرِئَ عَلَيْهِمُ الْقُرْآنُ لا يَسْجُدُونَ»،\n \n سورة الانشقاق: الآية 21.',
  '« كَلَّا لَا تُطِعْهُ وَاسْجُدْ وَاقْتَرِب»،\n\n  سورة العلق: الآية 19.'
];

class _SajdaAyattState extends State<SajdaAyatt> {
  int num;

  _SajdaAyattState(this.num);
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Color.fromARGB(255, 225, 225, 225),
      appBar: AppBar(
        backgroundColor: Color.fromARGB(255, 156, 156, 156),
        title: Text(
          'الأية التي تحتوي على السجدة ',
          style: TextStyle(
              fontSize: 22, color: Colors.white, fontWeight: FontWeight.bold),
        ),
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            SizedBox(
              height: 100,
            ),
            Container(
              // height: 400,
              margin: EdgeInsets.all(30),
              padding: EdgeInsets.all(20),
              decoration: BoxDecoration(
                  borderRadius: BorderRadius.all(
                    Radius.circular(20),
                  ),
                  color: Color.fromARGB(255, 156, 156, 156)),
              child: Text(
                textAlign: TextAlign.center,
                sajdaA[num],
                style: TextStyle(
                    fontSize: 35,
                    wordSpacing: 12,
                    letterSpacing: 0.5,
                    fontWeight: FontWeight.w200,
                    color: Colors.black),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
